PKS1C/src/Reports/ЗаработаноЗаМесяц/ЗаработаноЗаМесяц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ЗаработаноЗаМесяц</name>
</mdclass:Report>

PKS1C/src/InformationRegisters/ПочасовыеРаботы/ПочасовыеРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПочасовыеРаботы</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Удаленка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Сверхурочка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВремяЗатраты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СоставРабот</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ВремяПрибытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВремяЗавершения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкиКлиентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

PKS1C/src/Reports/ЗаработаноЗаМесяц/Forms/ФормаОтчета/Module.bsl
&НаКлиенте
Процедура ОтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ЭтаФорма.Месяц = ОткрытьФормуМодально("Обработка.ВыпадающийВыборПериода.Форма.Форма2");      
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере(ТабДок, Месяц)	
	Макет = Отчеты.ЗаработаноЗаМесяц.ПолучитьМакет("Макет");	
	Область = Макет.ПолучитьОбласть("Область");	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьИтоги = Макет.ПолучитьОбласть("Итоги");
	
	Область.Параметры.Месяц = Формат(Месяц, "ДФ=""дд.ММ.гггг""");
	
	ТабДок = Новый ТабличныйДокумент;                  
	ТабДок.Вывести(Область);
	
	ЗапросРабот = Новый Запрос;
	ЗапросРабот.Текст = 
		"ВЫБРАТЬ
		|	ПочасовыеРаботы.Клиент КАК Клиент,
		|	ПочасовыеРаботы.Удаленка КАК Удаленка,
		|	ПочасовыеРаботы.Сверхурочка КАК Сверхурочка,
		|	ПочасовыеРаботы.Исполнитель КАК Исполнитель,
		|	ПочасовыеРаботы.ВремяПрибытия КАК ВремяПрибытия,
		|	ПочасовыеРаботы.ВремяЗавершения КАК ВремяЗавершения,
		|	ПочасовыеРаботы.СоставРабот КАК СоставРабот,
		|	ПочасовыеРаботы.ВремяЗатраты КАК ВремяЗатраты,
		|	ПочасовыеРаботы.Регистратор.Дата КАК Дата,
		|	ПочасовыеРаботы.Организация КАК Организация,
		|	ПочасовыеРаботы.Регистратор.Ссылка КАК РегистраторСсылка
		|ИЗ
		|	РегистрСведений.ПочасовыеРаботы КАК ПочасовыеРаботы
		|ГДЕ
		|	ПочасовыеРаботы.Регистратор.Дата МЕЖДУ &От И &До";
	
	ЗапросРабот.УстановитьПараметр("До", КонецМесяца(Месяц));
	ЗапросРабот.УстановитьПараметр("От", Месяц);                                        
	
	РезультатЗапросаРабот = ЗапросРабот.Выполнить();	
	ВыборкаРабот = РезультатЗапросаРабот.Выбрать();
	
	Если ВыборкаРабот.Количество() = 0 Тогда
		Сообщить("Ничего не делали, ничего не заработали :("); 
		ТабДок.Вывести(ОбластьИтоги);
		Возврат;
	КонецЕсли;	
	
	СтоимостьИтоги = 0;
	ВремязатратыИтоги = 0;
	НомерРаботы = 1;
	
	Пока ВыборкаРабот.Следующий() Цикл
		Договор = Истина;
		ВыборкаЦен = ЗапросЦен(ВыборкаРабот.Организация, ВыборкаРабот.Дата);
		Если ВыборкаЦен.Количество() = 0 Тогда
			Сообщение = "ОШИБКА! С контрагенотом " + ВыборкаРабот.Организация + " к выбранному месяцу не был заключен договор обслуживания.";
			Сообщить(Сообщение);
			Договор = Ложь;
		КонецЕсли;
		ОбластьСтрока.Параметры.Дата = Формат(ВыборкаРабот.Дата, "ДФ=дд.ММ.гггг");
		ОбластьСтрока.Параметры.Исполнитель = ВыборкаРабот.Исполнитель;
		ОбластьСтрока.Параметры.Клиент = ВыборкаРабот.Клиент;			
		ОбластьСтрока.Параметры.ВремяПрибытия = Формат(ВыборкаРабот.ВремяПрибытия, "ДФ=""ЧЧ:мм:сс""");
		ОбластьСтрока.Параметры.ВремяЗавершения = Формат(ВыборкаРабот.ВремяЗавершения, "ДФ=""ЧЧ:мм:сс""");
		ОбластьСтрока.Параметры.Удаленка = ВыборкаРабот.Удаленка;
		ОбластьСтрока.Параметры.Сверхурочка = ВыборкаРабот.Сверхурочка;
		ОбластьСтрока.Параметры.СоставРабот = ВыборкаРабот.СоставРабот;
		ОбластьСтрока.Параметры.ВремяЗатраты = ВыборкаРабот.ВремяЗатраты; 
		ОбластьСтрока.Параметры.Документ = ВыборкаРабот.РегистраторСсылка;
		
		Если Договор Тогда
			ОбластьСтрока.Параметры.АбонентскаяПлата = ВыборкаЦен.АбонентскаяПлата;
			
			Если ВыборкаРабот.Сверхурочка И ВыборкаЦен.ТарифСверхурочный <> 0 Тогда
				ОбластьСтрока.Параметры.Тариф = ВыборкаЦен.ТарифСверхурочный;
				ОбластьСтрока.Параметры.Стоимость = ВыборкаЦен.ТарифСверхурочный * ВыборкаРабот.ВремяЗатраты;	
			Иначе
				ОбластьСтрока.Параметры.Тариф = ВыборкаЦен.Тариф;
				Если ОбластьСтрока.Параметры.АбонентскаяПлата Тогда
					ОбластьСтрока.Параметры.Стоимость = Цел(ПосчитатьТариф(ВыборкаРабот.Организация, ВыборкаРабот.Дата, Месяц, КонецМесяца(Месяц)) * ВыборкаРабот.ВремяЗатраты);
				Иначе
					ОбластьСтрока.Параметры.Стоимость = ВыборкаЦен.Тариф * ВыборкаРабот.ВремяЗатраты;
				КонецЕсли
			КонецЕсли;
		Иначе
			ОбластьСтрока.Параметры.АбонентскаяПлата = 0;
			ОбластьСтрока.Параметры.Тариф = Ложь;
			ОбластьСтрока.Параметры.Стоимость = 0;
		КонецЕсли;		 
		
		;
		
		СтоимостьИтоги = СтоимостьИтоги + ОбластьСтрока.Параметры.Стоимость;
		ВремязатратыИтоги = ВремязатратыИтоги + ОбластьСтрока.Параметры.ВремяЗатраты;
		ТабДок.Вывести(ОбластьСтрока);
		
		Если Не Договор Тогда
			Область= ТабДок.Область("R" + Строка(НомерРаботы + 3) + "C2:R" + Строка(НомерРаботы + 3) + "C13");
			Область.ЦветФона = WebЦвета.БледноКрасноФиолетовый;
		КонецЕсли;
		НомерРаботы = НомерРаботы + 1;
	КонецЦикла;
	
	ОбластьИтоги.Параметры.СтоимостьИтоги = СтоимостьИтоги;
	ОбластьИтоги.Параметры.ВремязатратыИтоги = ВремязатратыИтоги;
	ТабДок.Вывести(ОбластьИтоги);
	
	Если СтоимостьИтоги < 400000 Тогда
		Сообщить("Все очень плохо :(");
	ИначеЕсли СтоимостьИтоги > 1000000 Тогда
		Сообщить("Ну нифига себе ☺");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)	
	СформироватьНаСервере(ЭтаФорма.ТабДок, ЭтаФорма.Месяц);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Месяц = НачалоМесяца(ТекущаяДата());
КонецПроцедуры
